src/cf/src/InformationRegisters/ЦеныНоменклатуры/ЦеныНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЦеныНоменклатуры</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Цена</name>
    <type>
      <types>DefinedType.СуммаНеотрицательная</types>
    </type>
  </resources>
  <resources>
    <name>Упаковка</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </resources>
  <dimensions>
    <name>ТоварнаяГруппа</name>
    <type>
      <types>CatalogRef.ТоварныеГруппы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидЦены</name>
    <type>
      <types>CatalogRef.ВидыЦен</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/cf/src/Documents/ПоступлениеТоваровУслуг/ПоступлениеТоваровУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПоступлениеТоваровУслуг</name>
  <basedOn>Document.ЗаказПоставщику</basedOn>
  <basedOn>Document.РеализацияТоваровУслуг</basedOn>
  <basedOn>Document.ЗаказПокупателя</basedOn>
  <registerRecords>AccumulationRegister.Убытки</registerRecords>
  <registerRecords>AccumulationRegister.ДополнительныеРасходы</registerRecords>
  <registerRecords>InformationRegister.ЦеныНоменклатуры</registerRecords>
  <registerRecords>AccumulationRegister.ЗаказыПоставщикам</registerRecords>
  <registerRecords>AccountingRegister.Хозрасчетный</registerRecords>
  <registerRecords>InformationRegister.ЦеныНоменклатурыПоставщиков</registerRecords>
  <registerRecords>AccumulationRegister.ВзаиморасчётыСПоставщиками</registerRecords>
  <registerRecords>AccumulationRegister.ТоварыВНаличии</registerRecords>
  <registerRecords>AccumulationRegister.ПотребностиПроизводства</registerRecords>
  <attributes>
    <name>ДатаВходящегоДокумента</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыСКонтрагентами</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>DefinedType.Комментарий</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерВходящегоДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.ЗаказПоставщику</types>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>DefinedType.СуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаНДС</name>
    <type>
      <types>DefinedType.СуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаБезНДС</name>
    <type>
      <types>DefinedType.СуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>ХозяйственнаяОперация</name>
    <type>
      <types>EnumRef.ХозяйственныеОперации</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦенаВключаетНДС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыДокументов</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипЦеныПоТипуЦен</name>
    <type>
      <types>CatalogRef.ВидыЦен</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтгрузочногоДокумента</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерОтгрузочногоДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>КурсВалюты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ТЧТовары</name>
    <attributes>
      <name>КодСтроки</name>
      <type>
        <types>DefinedType.КодСтроки</types>
      </type>
    </attributes>
    <attributes>
      <name>НоменклатураКонтрагента</name>
      <type>
        <types>CatalogRef.НоменклатураКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>УказаноНесколькоСерий</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковокПринято</name>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоПринято</name>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаСНДС</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>CatalogRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаМинимальная</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаРозничная</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаПоТипуЦен</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТЧСерии</name>
    <attributes>
      <name>КодСтроки</name>
      <type>
        <types>DefinedType.КодСтроки</types>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТЧУслуги</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Содержание</name>
      <type>
        <types>DefinedType.Комментарий</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>CatalogRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаСНДС</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатьяДДС</name>
      <type>
        <types>CatalogRef.СтатьиДвиженияДенежныхСредств</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТЧДополнительныеРасходы</name>
    <attributes>
      <name>Договор</name>
      <type>
        <types>CatalogRef.ДоговорыСКонтрагентами</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>DefinedType.Комментарий</types>
      </type>
    </attributes>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>CatalogRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатьяДДС</name>
      <type>
        <types>CatalogRef.СтатьиДвиженияДенежныхСредств</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаСНДС</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТЧЗачётАвансов</name>
    <attributes>
      <name>Основание</name>
      <type>
        <types>DocumentRef.СписаниеБезналичныхДенежныхСредств</types>
        <types>DocumentRef.КорректировкаДолга</types>
        <types>DocumentRef.РасходныйКассовыйОрдер</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/cf/src/Catalogs/ВидыЦен/ВидыЦен.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВидыЦен</name>
  <predefined>
    <items>
      <name>Закупочная</name>
      <description>Prix d'achat</description>
    </items>
    <items>
      <name>Розничная</name>
      <description>Prix de vente</description>
    </items>
    <items>
      <name>МинимальнаяЦенаПродажи</name>
      <description>Prix minimal</description>
    </items>
  </predefined>
  <attributes>
    <name>ЦенаВключаетНДС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДинамическийРасчет</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсноваРасчёта</name>
    <type>
      <types>EnumRef.ОсновыРасчётаНаценок</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидНаценки</name>
    <type>
      <types>EnumRef.ВидыНаценок</types>
    </type>
  </attributes>
  <attributes>
    <name>Показатель</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </attributes>
  <attributes>
    <name>Точность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/cf/src/InformationRegisters/ЦеныНоменклатуры/ManagerModule.bsl
Функция ПоследнийПрайс(ДатаЦен, ВидЦены, МассивНоменклатуры = Неопределено) Экспорт
	//Запрос = Новый Запрос("ВЫБРАТЬ
	//                      |	ЦеныНоменклатурыСрезПоследних.Период КАК Период,
	//                      |	ЦеныНоменклатурыСрезПоследних.ВидЦены КАК ВидЦены,
	//                      |	ЦеныНоменклатурыСрезПоследних.ТоварнаяГруппа КАК ТоварнаяГруппа,
	//                      |	ЦеныНоменклатурыСрезПоследних.Номенклатура КАК Номенклатура,
	//                      |	ЦеныНоменклатурыСрезПоследних.Характеристика КАК Характеристика,
	//                      |	ЦеныНоменклатурыСрезПоследних.Цена КАК Цена,
	//                      |	ЦеныНоменклатурыСрезПоследних.Упаковка КАК Упаковка
	//                      |ПОМЕСТИТЬ ВТЦены
	//                      |ИЗ
	//                      |	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(&ДатаЦен, ВидЦены В (&ВидЦены)) КАК ЦеныНоменклатурыСрезПоследних
	//                      |;
	//                      |
	//                      |////////////////////////////////////////////////////////////////////////////////
	//                      |ВЫБРАТЬ
	//                      |	ВТЦены.Период КАК Период,
	//                      |	ВТЦены.ВидЦены КАК ВидЦены,
	//                      |	ВТЦены.Номенклатура КАК Номенклатура,
	//                      |	ВТЦены.Характеристика КАК Характеристика,
	//                      |	ВТЦены.Цена КАК Цена,
	//                      |	ВТЦены.Упаковка КАК Упаковка
	//                      |ИЗ
	//                      |	(ВЫБРАТЬ
	//                      |		МАКСИМУМ(ВТЦены.Период) КАК Период,
	//                      |		ВТЦены.ВидЦены КАК ВидЦены,
	//                      |		ВТЦены.ТоварнаяГруппа КАК ТоварнаяГруппа
	//                      |	ИЗ
	//                      |		ВТЦены КАК ВТЦены
	//                      |	
	//                      |	СГРУППИРОВАТЬ ПО
	//                      |		ВТЦены.ВидЦены,
	//                      |		ВТЦены.ТоварнаяГруппа) КАК ВЗ
	//                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТЦены КАК ВТЦены
	//                      |		ПО ВЗ.Период = ВТЦены.Период
	//                      |			И ВЗ.ВидЦены = ВТЦены.ВидЦены
	//                      |			И ВЗ.ТоварнаяГруппа = ВТЦены.ТоварнаяГруппа
	//                      |
	//                      |УПОРЯДОЧИТЬ ПО
	//                      |	ВТЦены.Номенклатура.Наименование,
	//                      |	ВТЦены.Характеристика.Наименование");
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ЦеныНоменклатурыСрезПоследних.ВидЦены КАК ВидЦены,
	                      |	ЦеныНоменклатурыСрезПоследних.Номенклатура КАК Номенклатура,
	                      |	ЦеныНоменклатурыСрезПоследних.Характеристика КАК Характеристика,
	                      |	ЦеныНоменклатурыСрезПоследних.Цена КАК Цена,
	                      |	ЦеныНоменклатурыСрезПоследних.Упаковка КАК Упаковка
	                      |ПОМЕСТИТЬ ВТЦены
	                      |ИЗ
	                      |	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
	                      |			&ДатаЦен,
	                      |			ВидЦены В (&ВидЦены)
	                      |				И ВЫБОР
	                      |					КОГДА &ЕстьМассивНоменклатуры
	                      |						ТОГДА Номенклатура В (&МассивНоменклатуры)
	                      |					ИНАЧЕ ИСТИНА
	                      |				КОНЕЦ) КАК ЦеныНоменклатурыСрезПоследних
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ВТЦены.ВидЦены КАК ВидЦены,
	                      |	ВТЦены.Номенклатура КАК Номенклатура,
	                      |	ВТЦены.Характеристика КАК Характеристика,
	                      |	ВТЦены.Цена КАК Цена,
	                      |	ВТЦены.Упаковка КАК Упаковка,
	                      |	ЕСТЬNULL(ВидыЦен.ЦенаВключаетНДС, ИСТИНА) КАК ЦенаВключаетНДС
	                      |ИЗ
	                      |	ВТЦены КАК ВТЦены
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВидыЦен КАК ВидыЦен
	                      |		ПО ВТЦены.ВидЦены = ВидыЦен.Ссылка
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Номенклатура
	                      |		ПО ВТЦены.Номенклатура = Номенклатура.Ссылка
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ХарактеристикиНоменклатуры КАК Характеристики
	                      |		ПО ВТЦены.Характеристика = Характеристики.Ссылка
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	Номенклатура.Наименование,
	                      |	Характеристики.Наименование");
	Запрос.УстановитьПараметр("ДатаЦен", ДатаЦен);
	Запрос.УстановитьПараметр("ВидЦены", ВидЦены);
	Запрос.УстановитьПараметр("ЕстьМассивНоменклатуры", Не МассивНоменклатуры = Неопределено);
	Запрос.УстановитьПараметр("МассивНоменклатуры", МассивНоменклатуры);
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции

Процедура СформироватьДвижения(ДокОбъект) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПоступлениеТоваровУслугТЧТовары.Номенклатура КАК Номенклатура,
	|	ПоступлениеТоваровУслугТЧТовары.Характеристика КАК Характеристика,
	|	МАКСИМУМ(ПоступлениеТоваровУслугТЧТовары.Цена) КАК Цена,
	|	МАКСИМУМ(ПоступлениеТоваровУслугТЧТовары.ЦенаМинимальная) КАК ЦенаМинимальная,
	|	МАКСИМУМ(ПоступлениеТоваровУслугТЧТовары.ЦенаРозничная) КАК ЦенаРозничная,
	|	МАКСИМУМ(ПоступлениеТоваровУслугТЧТовары.ЦенаПоТипуЦен) КАК ЦенаПоТипуЦен
	|ИЗ
	|	Документ.ПоступлениеТоваровУслуг.ТЧТовары КАК ПоступлениеТоваровУслугТЧТовары
	|ГДЕ
	|	ПоступлениеТоваровУслугТЧТовары.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ПоступлениеТоваровУслугТЧТовары.Характеристика,
	|	ПоступлениеТоваровУслугТЧТовары.Номенклатура";
	Запрос.УстановитьПараметр("ССылка",ДокОбъект.Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	ВидЦеныМин = Справочники.ВидыЦен.МинимальнаяЦенаПродажи;
	ВидЦеныРозн = Справочники.ВидыЦен.Розничная;
	ВидЦеныЗакуп = Справочники.ВидыЦен.Закупочная;
	ТипЦеныПоТипуЦен = ДокОбъект.ТипЦеныПоТипуЦен;
	Пока Выборка.Следующий() Цикл
		Стр = Выборка;
		Если Не Стр.ЦенаМинимальная = 0 Тогда 
			НС = ДокОбъект.Движения.ЦеныНоменклатуры.Добавить();
			НС.Период = ДокОбъект.Дата;
			НС.ВидЦены = ВидЦеныМин;
			НС.Номенклатура = Стр.Номенклатура;
			НС.Характеристика = Стр.Характеристика;
			НС.ТоварнаяГруппа = Стр.Номенклатура.ТоварнаяГруппа;
			НС.Цена = Стр.ЦенаМинимальная;
		КонецЕсли;
		Если Не Стр.ЦенаРозничная = 0 Тогда 
			НС = ДокОбъект.Движения.ЦеныНоменклатуры.Добавить();
			НС.Период = ДокОбъект.Дата;
			НС.ВидЦены = ВидЦеныРозн;
			НС.Номенклатура = Стр.Номенклатура;
			НС.Характеристика = Стр.Характеристика;
			НС.ТоварнаяГруппа = Стр.Номенклатура.ТоварнаяГруппа;
			НС.Цена = Стр.ЦенаРозничная;
		КонецЕсли;
		Если ЗначениеЗаполнено(ТипЦеныПоТипуЦен) И ТипЦеныПоТипуЦен <> ВидЦеныРозн И ТипЦеныПоТипуЦен <> ВидЦеныМин Тогда
			Если Не Стр.ЦенаПоТипуЦен = 0 Тогда 
				НС = ДокОбъект.Движения.ЦеныНоменклатуры.Добавить();
				НС.Период = ДокОбъект.Дата;
				НС.ВидЦены = ТипЦеныПоТипуЦен;
				НС.Номенклатура = Стр.Номенклатура;
				НС.Характеристика = Стр.Характеристика;
				НС.ТоварнаяГруппа = Стр.Номенклатура.ТоварнаяГруппа;
				НС.Цена = Стр.ЦенаПоТипуЦен;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры
